perf/proxy-9090/endurance/endurance.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Linear
      duration: 30
      arrivalRate: 5
      rampTo: 200
    - name: Soak
      duration: 600
      arrivalRate: 200
    - name: down
      duration: 30
      arrivalRate: 5

scenarios:      
  - name: Bbox1 (/)
    flow:
      - get:
          url: '/proxy-9090'